/*
Задача 44: Не используя рекурсию, выведите первые N чисел Фибоначчи. 
Первые два числа Фибоначчи: 0 и 1.
Если N = 5 -> 0 1 1 2 3
Если N = 3 -> 0 1 1
Если N = 7 -> 0 1 1 2 3 5 8
*/


int EnteringNumber(string text)//Метод ввода числа, проверки на число "int"
{
    Console.WriteLine(text);
EnterNumber:
    int num = 0;
    bool isNum = int.TryParse(Console.ReadLine(), out num);
    if (isNum == false)
    { 
        Console.WriteLine("Введенное значение не является простым числом. Повторите ввод числе ещё раз:");
        goto EnterNumber;
    }
    return num;
}
int N = EnteringNumber("Введите целое число");

array[0]=0;
array[1]=1;
for(i=2; i<N; i++)
{
array[i]=array[i-1]+array[i-2];
}

Console.WriteLine($"[{String.Join("; ", array)}]");
